In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

from pandas import Series, DataFrame

In [2]:
data = pd.read_csv('StudentsPerformance.csv')

In [3]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [4]:
data.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [5]:
data.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

# Number of females and males

In [6]:
data['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# Parental level of education

In [7]:
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [ ]:
# While 448 parents have attended college or hold associate's degree, only 177 i.e. 17.7% of parents hold bachelors or masters degree. 37.5% of parents hold high school diploma or have attended high school.

# Average of scores based on gender

In [8]:
data[['gender','math score', 'reading score', 'writing score']].groupby('gender').mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [ ]:
# For maths, male students scored higher on average, while in reading and writing, female students scored higher on average.

# Average of scores based on test preparation course

In [9]:
data[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [ ]:
# Students who completed test preparation course scored higher on average for all three subject tests.

# Variance of scores based on gender

In [10]:
data[['gender','math score', 'reading score', 'writing score']].groupby('gender').var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [ ]:
# Variation of scores of all subject tests are higher for female students. Female students scores in math test have the highest variation, while male students in reading test have the lowest variation in scores.

# Variance of scores based on test preparation course

In [11]:
data[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [ ]:
# Variation of test scores for students who completed test preparation is lower than students who did not attend the course. The variation is lowest for scores in writing test and variation is highest for students who did not attend the test preparation course in math test.

# Top 25% of math scores

In [12]:
topmath = data['math score'].nlargest(int(len(data)*0.25))

In [13]:
pd.DataFrame(data=topmath)

     math score
515         100
516         100
517         100
996         100
997         100
..          ...
428          77
429          77
849          77
850          77
851          77

[250 rows x 1 columns]

In [ ]:
# Dataframe topmath gives the 250 students with the highest scores in math test. The dataframe can be used to give bonus points to the respective students.